In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('dataset_1672182.csv')
df.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,unit_price,product_category,product_type
0,1,06/07/2023,17:56:22,1.0,2.0,Utrecht,4.50,Chocolate,Hot chocolate
1,2,06/10/2023,12:32:57,2.0,2.0,Utrecht,4.25,Coffee,Syrup coffee
2,3,06/05/2023,10:17:06,1.0,1.0,Alkmaar,3.00,Tea,Black tea
3,4,06/06/2023,15:54:08,3.0,1.0,Alkmaar,3.50,Coffee,Milk coffee
4,5,06/09/2023,10:08:03,1.0,3.0,Eindhoven,4.50,Chocolate,Hot chocolate